garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC12LF1612.PIC
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x29F"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="6" edc:beginaddr="0x300" edc:endaddr="0x320" edc:regionid="sfr6">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x300"/>
        <edc:SFRDef edc:access="--nn-nnn" edc:cname="SLRCONA" edc:desc="" edc:impl="0x37" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--11-111" edc:name="SLRCONA" edc:nzwidth="8" edc:por="--11-111" edc:_addr="0x30C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLRA0" edc:desc="" edc:mask="0x1" edc:name="SLRA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRA1" edc:desc="" edc:mask="0x1" edc:name="SLRA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRA2" edc:desc="" edc:mask="0x1" edc:name="SLRA2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SLRA4" edc:desc="" edc:mask="0x1" edc:name="SLRA4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRA5" edc:desc="" edc:mask="0x1" edc:name="SLRA5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x30D"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x30E"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="7" edc:beginaddr="0x380" edc:endaddr="0x3A0" edc:regionid="sfr7">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x380"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="INLVLA" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111" edc:name="INLVLA" edc:nzwidth="8" edc:por="--111111" edc:_addr="0x38C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INLVLA0" edc:desc="" edc:mask="0x1" edc:name="INLVLA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA1" edc:desc="" edc:mask="0x1" edc:name="INLVLA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA2" edc:desc="" edc:mask="0x1" edc:name="INLVLA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA3" edc:desc="" edc:mask="0x1" edc:name="INLVLA3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA4" edc:desc="" edc:mask="0x1" edc:name="INLVLA4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA5" edc:desc="" edc:mask="0x1" edc:name="INLVLA5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x38D"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x38E"/>
        <edc:AdjustPoint edc:offset="2" edc:_addr="0x38F"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="IOCAP" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="IOCAP" edc:nzwidth="8" edc:por="--000000" edc:_addr="0x391">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCAP0" edc:mask="0x1" edc:name="IOCAP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAP1" edc:mask="0x1" edc:name="IOCAP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAP2" edc:mask="0x1" edc:name="IOCAP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAP3" edc:mask="0x1" edc:name="IOCAP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAP4" edc:mask="0x1" edc:name="IOCAP4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAP5" edc:mask="0x1" edc:name="IOCAP5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IOCAP" edc:mask="0x3f" edc:name="IOCAP" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="IOCAN" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="IOCAN" edc:nzwidth="8" edc:por="--000000" edc:_addr="0x392">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCAN0" edc:mask="0x1" edc:name="IOCAN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAN1" edc:mask="0x1" edc:name="IOCAN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAN2" edc:mask="0x1" edc:name="IOCAN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAN3" edc:mask="0x1" edc:name="IOCAN3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAN4" edc:mask="0x1" edc:name="IOCAN4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAN5" edc:mask="0x1" edc:name="IOCAN5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IOCAN" edc:mask="0x3f" edc:name="IOCAN" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="IOCAF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="IOCAF" edc:nzwidth="8" edc:por="--000000" edc:_addr="0x393">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCAF0" edc:mask="0x1" edc:name="IOCAF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF1" edc:mask="0x1" edc:name="IOCAF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF2" edc:mask="0x1" edc:name="IOCAF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF3" edc:mask="0x1" edc:name="IOCAF3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF4" edc:mask="0x1" edc:name="IOCAF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCAF5" edc:mask="0x1" edc:name="IOCAF5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IOCAF" edc:mask="0x3f" edc:name="IOCAF" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="3" edc:_addr="0x394"/>
        <edc:AdjustPoint edc:offset="3" edc:_addr="0x397"/>
        <edc:AdjustPoint edc:offset="6" edc:_addr="0x39A"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="8" edc:beginaddr="0x400" edc:endaddr="0x420" edc:regionid="sfr8">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x400"/>
        <edc:AdjustPoint edc:offset="7" edc:_addr="0x40C"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T4TMR" edc:desc="8-bit period timer" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="T4TMR" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02458_tmr_mid2_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x413">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TMR4"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR4" edc:desc="" edc:mask="0xff" edc:name="TMR4" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T4PR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="T4PR" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-02458_tmr_mid2_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x414">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PR4"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR4" edc:desc="" edc:mask="0xff" edc:name="PR4" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T4CON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0xxxxxxx" edc:name="T4CON" edc:nzwidth="8" edc:por="0xxxxxxx" edc:_modsrc="DOS-02458_tmr_mid2_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x415">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OUTPS" edc:desc="" edc:mask="0xf" edc:name="OUTPS" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="CKPS" edc:desc="" edc:mask="0x7" edc:name="CKPS" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T4OUTPS" edc:desc="" edc:mask="0xf" edc:name="T4OUTPS" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="T4CKPS" edc:desc="" edc:mask="0x7" edc:name="T4CKPS" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="T4ON" edc:desc="" edc:mask="0x1" edc:name="T4ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T4OUTPS0" edc:desc="" edc:mask="0x1" edc:name="T4OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS1" edc:desc="" edc:mask="0x1" edc:name="T4OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS2" edc:desc="" edc:mask="0x1" edc:name="T4OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS3" edc:desc="" edc:mask="0x1" edc:name="T4OUTPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4CKPS0" edc:desc="" edc:mask="0x1" edc:name="T4CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4CKPS1" edc:desc="" edc:mask="0x1" edc:name="T4CKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4CKPS2" edc:desc="" edc:mask="0x1" edc:name="T4CKPS2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OUTPS0" edc:desc="" edc:mask="0x1" edc:name="OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUTPS1" edc:desc="" edc:mask="0x1" edc:name="OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUTPS2" edc:desc="" edc:mask="0x1" edc:name="OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUTPS3" edc:desc="" edc:mask="0x1" edc:name="OUTPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPS0" edc:desc="" edc:mask="0x1" edc:name="CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPS1" edc:desc="" edc:mask="0x1" edc:name="CKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPS2" edc:desc="" edc:mask="0x1" edc:name="CKPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR4ON" edc:desc="" edc:mask="0x1" edc:name="TMR4ON" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-nnnn" edc:cname="T4HLT" edc:desc="" edc:impl="0xef" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00x-0000" edc:name="T4HLT" edc:nzwidth="8" edc:por="00x-0000" edc:_modsrc="DOS-02458_tmr_mid2_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x416">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0xf" edc:name="MODE" edc:nzwidth="4"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CKSYNC" edc:desc="" edc:mask="0x1" edc:name="CKSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPOL" edc:desc="" edc:mask="0x1" edc:name="CKPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSYNC" edc:desc="" edc:mask="0x1" edc:name="PSYNC" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE3" edc:desc="" edc:mask="0x1" edc:name="MODE3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T4MODE" edc:desc="" edc:mask="0xf" edc:name="T4MODE" edc:nzwidth="4"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T4CKSYNC" edc:desc="" edc:mask="0x1" edc:name="T4CKSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4CKPOL" edc:desc="" edc:mask="0x1" edc:name="T4CKPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4PSYNC" edc:desc="" edc:mask="0x1" edc:name="T4PSYNC" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T4MODE0" edc:desc="" edc:mask="0x1" edc:name="T4MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4MODE1" edc:desc="" edc:mask="0x1" edc:name="T4MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4MODE2" edc:desc="" edc:mask="0x1" edc:name="T4MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4MODE3" edc:desc="" edc:mask="0x1" edc:name="T4MODE3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="T4CLKCON" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="T4CLKCON" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02458_tmr_mid2_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x417">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T4CS" edc:desc="" edc:mask="0x7" edc:name="T4CS" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T4CS0" edc:desc="" edc:mask="0x1" edc:name="T4CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4CS1" edc:desc="" edc:mask="0x1" edc:name="T4CS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4CS2" edc:desc="" edc:mask="0x1" edc:name="T4CS2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="T4RST" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="T4RST" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02458_tmr_mid2_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x418">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RSEL" edc:desc="" edc:mask="0xf" edc:name="RSEL" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RSEL0" edc:desc="" edc:mask="0x1" edc:name="RSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSEL1" edc:desc="" edc:mask="0x1" edc:name="RSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSEL2" edc:desc="" edc:mask="0x1" edc:name="RSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSEL3" edc:desc="" edc:mask="0x1" edc:name="RSEL3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T4RSEL" edc:desc="" edc:mask="0xf" edc:name="T4RSEL" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T4RSEL0" edc:desc="" edc:mask="0x1" edc:name="T4RSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4RSEL1" edc:desc="" edc:mask="0x1" edc:name="T4RSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4RSEL2" edc:desc="" edc:mask="0x1" edc:name="T4RSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4RSEL3" edc:desc="" edc:mask="0x1" edc:name="T4RSEL3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x419"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T6TMR" edc:desc="8-bit period timer" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="T6TMR" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02458_tmr_mid2_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x41A">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TMR6"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR6" edc:desc="" edc:mask="0xff" edc:name="TMR6" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T6PR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="T6PR" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-02458_tmr_mid2_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x41B">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PR6"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR6" edc:desc="" edc:mask="0xff" edc:name="PR6" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
