garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC12LF1612.PIC
        <edc:SFRDef edc:access="-----nnn" edc:cname="SMT1CLK" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="SMT1CLK" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD9B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CSEL" edc:desc="" edc:mask="0x7" edc:name="CSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CSEL0" edc:desc="" edc:mask="0x1" edc:name="CSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSEL1" edc:desc="" edc:mask="0x1" edc:name="CSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSEL2" edc:desc="" edc:mask="0x1" edc:name="CSEL2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SMT1CSEL" edc:desc="" edc:mask="0x7" edc:name="SMT1CSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SMT1CSEL0" edc:desc="" edc:mask="0x1" edc:name="SMT1CSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1CSEL1" edc:desc="" edc:mask="0x1" edc:name="SMT1CSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1CSEL2" edc:desc="" edc:mask="0x1" edc:name="SMT1CSEL2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="SMT1SIG" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="SMT1SIG" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD9C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSEL" edc:desc="" edc:mask="0x7" edc:name="SSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SSEL0" edc:desc="" edc:mask="0x1" edc:name="SSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSEL1" edc:desc="" edc:mask="0x1" edc:name="SSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSEL2" edc:desc="" edc:mask="0x1" edc:name="SSEL2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SMT1SSEL" edc:desc="" edc:mask="0x7" edc:name="SMT1SSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SMT1SSEL0" edc:desc="" edc:mask="0x1" edc:name="SMT1SSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1SSEL1" edc:desc="" edc:mask="0x1" edc:name="SMT1SSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1SSEL2" edc:desc="" edc:mask="0x1" edc:name="SMT1SSEL2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="SMT1WIN" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="SMT1WIN" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD9D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WSEL" edc:desc="" edc:mask="0xf" edc:name="WSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="WSEL0" edc:desc="" edc:mask="0x1" edc:name="WSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WSEL1" edc:desc="" edc:mask="0x1" edc:name="WSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WSEL2" edc:desc="" edc:mask="0x1" edc:name="WSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WSEL3" edc:desc="" edc:mask="0x1" edc:name="WSEL3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SMT1WSEL" edc:desc="" edc:mask="0xf" edc:name="SMT1WSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SMT1WSEL0" edc:desc="" edc:mask="0x1" edc:name="SMT1WSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1WSEL1" edc:desc="" edc:mask="0x1" edc:name="SMT1WSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1WSEL2" edc:desc="" edc:mask="0x1" edc:name="SMT1WSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1WSEL3" edc:desc="" edc:mask="0x1" edc:name="SMT1WSEL3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="SMT2TMR" edc:desc="" edc:name="SMT2TMR" edc:nzwidth="0x18" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD9E">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SMT2TMRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SMT2TMRL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD9E">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT2TMR" edc:desc="" edc:mask="0xff" edc:name="SMT2TMR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT2TMR0" edc:desc="" edc:mask="0x1" edc:name="SMT2TMR0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2TMR1" edc:desc="" edc:mask="0x1" edc:name="SMT2TMR1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2TMR2" edc:desc="" edc:mask="0x1" edc:name="SMT2TMR2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2TMR3" edc:desc="" edc:mask="0x1" edc:name="SMT2TMR3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2TMR4" edc:desc="" edc:mask="0x1" edc:name="SMT2TMR4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2TMR5" edc:desc="" edc:mask="0x1" edc:name="SMT2TMR5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2TMR6" edc:desc="" edc:mask="0x1" edc:name="SMT2TMR6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2TMR7" edc:desc="" edc:mask="0x1" edc:name="SMT2TMR7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SMT2TMRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SMT2TMRH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0xD9F">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT2TMR" edc:desc="" edc:mask="0xff" edc:name="SMT2TMR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT2TMR8" edc:desc="" edc:mask="0x1" edc:name="SMT2TMR8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2TMR9" edc:desc="" edc:mask="0x1" edc:name="SMT2TMR9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2TMR10" edc:desc="" edc:mask="0x1" edc:name="SMT2TMR10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2TMR11" edc:desc="" edc:mask="0x1" edc:name="SMT2TMR11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2TMR12" edc:desc="" edc:mask="0x1" edc:name="SMT2TMR12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2TMR13" edc:desc="" edc:mask="0x1" edc:name="SMT2TMR13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2TMR14" edc:desc="" edc:mask="0x1" edc:name="SMT2TMR14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT2TMR15" edc:desc="" edc:mask="0x1" edc:name="SMT2TMR15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
